espressif/esp-idf/components/soc/esp32p4/include/soc/soc_etm_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Status register */
/** Type of ch_ena_ad0 register
 *  Channel enable status register
 */
typedef union {
    struct {
        /** ch_ena0 : R/WTC/WTS; bitpos: [0]; default: 0;
         *  Represents ch0 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena0:1;
        /** ch_ena1 : R/WTC/WTS; bitpos: [1]; default: 0;
         *  Represents ch1 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena1:1;
        /** ch_ena2 : R/WTC/WTS; bitpos: [2]; default: 0;
         *  Represents ch2 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena2:1;
        /** ch_ena3 : R/WTC/WTS; bitpos: [3]; default: 0;
         *  Represents ch3 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena3:1;
        /** ch_ena4 : R/WTC/WTS; bitpos: [4]; default: 0;
         *  Represents ch4 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena4:1;
        /** ch_ena5 : R/WTC/WTS; bitpos: [5]; default: 0;
         *  Represents ch5 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena5:1;
        /** ch_ena6 : R/WTC/WTS; bitpos: [6]; default: 0;
         *  Represents ch6 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena6:1;
        /** ch_ena7 : R/WTC/WTS; bitpos: [7]; default: 0;
         *  Represents ch7 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena7:1;
        /** ch_ena8 : R/WTC/WTS; bitpos: [8]; default: 0;
         *  Represents ch8 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena8:1;
        /** ch_ena9 : R/WTC/WTS; bitpos: [9]; default: 0;
         *  Represents ch9 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena9:1;
        /** ch_ena10 : R/WTC/WTS; bitpos: [10]; default: 0;
         *  Represents ch10 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena10:1;
        /** ch_ena11 : R/WTC/WTS; bitpos: [11]; default: 0;
         *  Represents ch11 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena11:1;
        /** ch_ena12 : R/WTC/WTS; bitpos: [12]; default: 0;
         *  Represents ch12 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena12:1;
        /** ch_ena13 : R/WTC/WTS; bitpos: [13]; default: 0;
         *  Represents ch13 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena13:1;
        /** ch_ena14 : R/WTC/WTS; bitpos: [14]; default: 0;
         *  Represents ch14 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena14:1;
        /** ch_ena15 : R/WTC/WTS; bitpos: [15]; default: 0;
         *  Represents ch15 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena15:1;
        /** ch_ena16 : R/WTC/WTS; bitpos: [16]; default: 0;
         *  Represents ch16 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena16:1;
        /** ch_ena17 : R/WTC/WTS; bitpos: [17]; default: 0;
         *  Represents ch17 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena17:1;
        /** ch_ena18 : R/WTC/WTS; bitpos: [18]; default: 0;
         *  Represents ch18 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena18:1;
        /** ch_ena19 : R/WTC/WTS; bitpos: [19]; default: 0;
         *  Represents ch19 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena19:1;
        /** ch_ena20 : R/WTC/WTS; bitpos: [20]; default: 0;
         *  Represents ch20 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena20:1;
        /** ch_ena21 : R/WTC/WTS; bitpos: [21]; default: 0;
         *  Represents ch21 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena21:1;
        /** ch_ena22 : R/WTC/WTS; bitpos: [22]; default: 0;
         *  Represents ch22 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena22:1;
        /** ch_ena23 : R/WTC/WTS; bitpos: [23]; default: 0;
         *  Represents ch23 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena23:1;
        /** ch_ena24 : R/WTC/WTS; bitpos: [24]; default: 0;
         *  Represents ch24 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena24:1;
        /** ch_ena25 : R/WTC/WTS; bitpos: [25]; default: 0;
         *  Represents ch25 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena25:1;
        /** ch_ena26 : R/WTC/WTS; bitpos: [26]; default: 0;
         *  Represents ch26 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena26:1;
        /** ch_ena27 : R/WTC/WTS; bitpos: [27]; default: 0;
         *  Represents ch27 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena27:1;
        /** ch_ena28 : R/WTC/WTS; bitpos: [28]; default: 0;
         *  Represents ch28 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena28:1;
        /** ch_ena29 : R/WTC/WTS; bitpos: [29]; default: 0;
         *  Represents ch29 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena29:1;
        /** ch_ena30 : R/WTC/WTS; bitpos: [30]; default: 0;
         *  Represents ch30 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena30:1;
        /** ch_ena31 : R/WTC/WTS; bitpos: [31]; default: 0;
         *  Represents ch31 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_reg_t;

/** Type of ch_ena_ad1 register
 *  Channel enable status register
 */
typedef union {
    struct {
        /** ch_ena32 : R/WTC/WTS; bitpos: [0]; default: 0;
         *  Represents ch32 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena32:1;
        /** ch_ena33 : R/WTC/WTS; bitpos: [1]; default: 0;
         *  Represents ch33 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena33:1;
        /** ch_ena34 : R/WTC/WTS; bitpos: [2]; default: 0;
         *  Represents ch34 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena34:1;
        /** ch_ena35 : R/WTC/WTS; bitpos: [3]; default: 0;
         *  Represents ch35 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena35:1;
        /** ch_ena36 : R/WTC/WTS; bitpos: [4]; default: 0;
         *  Represents ch36 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena36:1;
        /** ch_ena37 : R/WTC/WTS; bitpos: [5]; default: 0;
         *  Represents ch37 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena37:1;
        /** ch_ena38 : R/WTC/WTS; bitpos: [6]; default: 0;
         *  Represents ch38 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena38:1;
        /** ch_ena39 : R/WTC/WTS; bitpos: [7]; default: 0;
         *  Represents ch39 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena39:1;
        /** ch_ena40 : R/WTC/WTS; bitpos: [8]; default: 0;
         *  Represents ch40 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena40:1;
        /** ch_ena41 : R/WTC/WTS; bitpos: [9]; default: 0;
         *  Represents ch41 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena41:1;
        /** ch_ena42 : R/WTC/WTS; bitpos: [10]; default: 0;
         *  Represents ch42 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena42:1;
        /** ch_ena43 : R/WTC/WTS; bitpos: [11]; default: 0;
         *  Represents ch43 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena43:1;
        /** ch_ena44 : R/WTC/WTS; bitpos: [12]; default: 0;
         *  Represents ch44 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena44:1;
        /** ch_ena45 : R/WTC/WTS; bitpos: [13]; default: 0;
         *  Represents ch45 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena45:1;
        /** ch_ena46 : R/WTC/WTS; bitpos: [14]; default: 0;
         *  Represents ch46 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena46:1;
        /** ch_ena47 : R/WTC/WTS; bitpos: [15]; default: 0;
         *  Represents ch47 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena47:1;
        /** ch_ena48 : R/WTC/WTS; bitpos: [16]; default: 0;
         *  Represents ch48 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena48:1;
        /** ch_ena49 : R/WTC/WTS; bitpos: [17]; default: 0;
         *  Represents ch49 enable status.\\0: Disable\\1: Enable
         */
        uint32_t ch_ena49:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_ch_ena_ad1_reg_t;

/** Type of evt_st0 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** gpio_evt_ch0_rise_edge_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents GPIO_evt_ch0_rise_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch0_rise_edge_st:1;
        /** gpio_evt_ch1_rise_edge_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents GPIO_evt_ch1_rise_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch1_rise_edge_st:1;
        /** gpio_evt_ch2_rise_edge_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents GPIO_evt_ch2_rise_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch2_rise_edge_st:1;
        /** gpio_evt_ch3_rise_edge_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents GPIO_evt_ch3_rise_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch3_rise_edge_st:1;
        /** gpio_evt_ch4_rise_edge_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents GPIO_evt_ch4_rise_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch4_rise_edge_st:1;
        /** gpio_evt_ch5_rise_edge_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents GPIO_evt_ch5_rise_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch5_rise_edge_st:1;
        /** gpio_evt_ch6_rise_edge_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents GPIO_evt_ch6_rise_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch6_rise_edge_st:1;
        /** gpio_evt_ch7_rise_edge_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents GPIO_evt_ch7_rise_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch7_rise_edge_st:1;
        /** gpio_evt_ch0_fall_edge_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents GPIO_evt_ch0_fall_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch0_fall_edge_st:1;
        /** gpio_evt_ch1_fall_edge_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents GPIO_evt_ch1_fall_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch1_fall_edge_st:1;
        /** gpio_evt_ch2_fall_edge_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents GPIO_evt_ch2_fall_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch2_fall_edge_st:1;
        /** gpio_evt_ch3_fall_edge_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents GPIO_evt_ch3_fall_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch3_fall_edge_st:1;
        /** gpio_evt_ch4_fall_edge_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents GPIO_evt_ch4_fall_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch4_fall_edge_st:1;
        /** gpio_evt_ch5_fall_edge_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents GPIO_evt_ch5_fall_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch5_fall_edge_st:1;
        /** gpio_evt_ch6_fall_edge_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents GPIO_evt_ch6_fall_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch6_fall_edge_st:1;
        /** gpio_evt_ch7_fall_edge_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents GPIO_evt_ch7_fall_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch7_fall_edge_st:1;
        /** gpio_evt_ch0_any_edge_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents GPIO_evt_ch0_any_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch0_any_edge_st:1;
        /** gpio_evt_ch1_any_edge_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents GPIO_evt_ch1_any_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch1_any_edge_st:1;
        /** gpio_evt_ch2_any_edge_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents GPIO_evt_ch2_any_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch2_any_edge_st:1;
        /** gpio_evt_ch3_any_edge_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents GPIO_evt_ch3_any_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch3_any_edge_st:1;
        /** gpio_evt_ch4_any_edge_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents GPIO_evt_ch4_any_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch4_any_edge_st:1;
        /** gpio_evt_ch5_any_edge_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents GPIO_evt_ch5_any_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch5_any_edge_st:1;
        /** gpio_evt_ch6_any_edge_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents GPIO_evt_ch6_any_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch6_any_edge_st:1;
        /** gpio_evt_ch7_any_edge_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents GPIO_evt_ch7_any_edge trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_ch7_any_edge_st:1;
        /** gpio_evt_zero_det_pos0_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents GPIO_evt_zero_det_pos0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_zero_det_pos0_st:1;
        /** gpio_evt_zero_det_neg0_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents GPIO_evt_zero_det_neg0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_zero_det_neg0_st:1;
        /** gpio_evt_zero_det_pos1_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents GPIO_evt_zero_det_pos1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_zero_det_pos1_st:1;
        /** gpio_evt_zero_det_neg1_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents GPIO_evt_zero_det_neg1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_evt_zero_det_neg1_st:1;
        /** ledc_evt_duty_chng_end_ch0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_evt_duty_chng_end_ch0_st:1;
        /** ledc_evt_duty_chng_end_ch1_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_evt_duty_chng_end_ch1_st:1;
        /** ledc_evt_duty_chng_end_ch2_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch2 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_evt_duty_chng_end_ch2_st:1;
        /** ledc_evt_duty_chng_end_ch3_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch3 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_evt_duty_chng_end_ch3_st:1;
    };
    uint32_t val;
} soc_etm_evt_st0_reg_t;

