espressif/esp-idf/components/soc/esp32p4/include/soc/soc_etm_struct.h
/** Type of task_st3 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** tg0_task_cnt_cap_timer0_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents TG0_task_cnt_cap_timer0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg0_task_cnt_cap_timer0_st:1;
        /** tg0_task_cnt_start_timer1_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents TG0_task_cnt_start_timer1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg0_task_cnt_start_timer1_st:1;
        /** tg0_task_alarm_start_timer1_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents TG0_task_alarm_start_timer1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t tg0_task_alarm_start_timer1_st:1;
        /** tg0_task_cnt_stop_timer1_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents TG0_task_cnt_stop_timer1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg0_task_cnt_stop_timer1_st:1;
        /** tg0_task_cnt_reload_timer1_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents TG0_task_cnt_reload_timer1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t tg0_task_cnt_reload_timer1_st:1;
        /** tg0_task_cnt_cap_timer1_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents TG0_task_cnt_cap_timer1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg0_task_cnt_cap_timer1_st:1;
        /** tg1_task_cnt_start_timer0_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents TG1_task_cnt_start_timer0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg1_task_cnt_start_timer0_st:1;
        /** tg1_task_alarm_start_timer0_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents TG1_task_alarm_start_timer0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t tg1_task_alarm_start_timer0_st:1;
        /** tg1_task_cnt_stop_timer0_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents TG1_task_cnt_stop_timer0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg1_task_cnt_stop_timer0_st:1;
        /** tg1_task_cnt_reload_timer0_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents TG1_task_cnt_reload_timer0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t tg1_task_cnt_reload_timer0_st:1;
        /** tg1_task_cnt_cap_timer0_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents TG1_task_cnt_cap_timer0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg1_task_cnt_cap_timer0_st:1;
        /** tg1_task_cnt_start_timer1_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents TG1_task_cnt_start_timer1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg1_task_cnt_start_timer1_st:1;
        /** tg1_task_alarm_start_timer1_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents TG1_task_alarm_start_timer1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t tg1_task_alarm_start_timer1_st:1;
        /** tg1_task_cnt_stop_timer1_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents TG1_task_cnt_stop_timer1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg1_task_cnt_stop_timer1_st:1;
        /** tg1_task_cnt_reload_timer1_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents TG1_task_cnt_reload_timer1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t tg1_task_cnt_reload_timer1_st:1;
        /** tg1_task_cnt_cap_timer1_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents TG1_task_cnt_cap_timer1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg1_task_cnt_cap_timer1_st:1;
        /** mcpwm0_task_cmpr0_a_up_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents MCPWM0_task_cmpr0_a_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_cmpr0_a_up_st:1;
        /** mcpwm0_task_cmpr1_a_up_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents MCPWM0_task_cmpr1_a_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_cmpr1_a_up_st:1;
        /** mcpwm0_task_cmpr2_a_up_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents MCPWM0_task_cmpr2_a_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_cmpr2_a_up_st:1;
        /** mcpwm0_task_cmpr0_b_up_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents MCPWM0_task_cmpr0_b_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_cmpr0_b_up_st:1;
        /** mcpwm0_task_cmpr1_b_up_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents MCPWM0_task_cmpr1_b_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_cmpr1_b_up_st:1;
        /** mcpwm0_task_cmpr2_b_up_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents MCPWM0_task_cmpr2_b_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_cmpr2_b_up_st:1;
        /** mcpwm0_task_gen_stop_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents MCPWM0_task_gen_stop trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_gen_stop_st:1;
        /** mcpwm0_task_timer0_syn_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents MCPWM0_task_timer0_syn trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_timer0_syn_st:1;
        /** mcpwm0_task_timer1_syn_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents MCPWM0_task_timer1_syn trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_timer1_syn_st:1;
        /** mcpwm0_task_timer2_syn_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents MCPWM0_task_timer2_syn trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_timer2_syn_st:1;
        /** mcpwm0_task_timer0_period_up_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents MCPWM0_task_timer0_period_up trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t mcpwm0_task_timer0_period_up_st:1;
        /** mcpwm0_task_timer1_period_up_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents MCPWM0_task_timer1_period_up trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t mcpwm0_task_timer1_period_up_st:1;
        /** mcpwm0_task_timer2_period_up_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents MCPWM0_task_timer2_period_up trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t mcpwm0_task_timer2_period_up_st:1;
        /** mcpwm0_task_tz0_ost_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents MCPWM0_task_tz0_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_tz0_ost_st:1;
        /** mcpwm0_task_tz1_ost_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents MCPWM0_task_tz1_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_tz1_ost_st:1;
        /** mcpwm0_task_tz2_ost_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents MCPWM0_task_tz2_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_tz2_ost_st:1;
    };
    uint32_t val;
} soc_etm_task_st3_reg_t;

/** Type of task_st4 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** mcpwm0_task_clr0_ost_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents MCPWM0_task_clr0_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_clr0_ost_st:1;
        /** mcpwm0_task_clr1_ost_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents MCPWM0_task_clr1_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_clr1_ost_st:1;
        /** mcpwm0_task_clr2_ost_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents MCPWM0_task_clr2_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_clr2_ost_st:1;
        /** mcpwm0_task_cap0_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents MCPWM0_task_cap0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_cap0_st:1;
        /** mcpwm0_task_cap1_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents MCPWM0_task_cap1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_cap1_st:1;
        /** mcpwm0_task_cap2_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents MCPWM0_task_cap2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_task_cap2_st:1;
        /** mcpwm1_task_cmpr0_a_up_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents MCPWM1_task_cmpr0_a_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_cmpr0_a_up_st:1;
        /** mcpwm1_task_cmpr1_a_up_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents MCPWM1_task_cmpr1_a_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_cmpr1_a_up_st:1;
        /** mcpwm1_task_cmpr2_a_up_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents MCPWM1_task_cmpr2_a_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_cmpr2_a_up_st:1;
        /** mcpwm1_task_cmpr0_b_up_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents MCPWM1_task_cmpr0_b_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_cmpr0_b_up_st:1;
        /** mcpwm1_task_cmpr1_b_up_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents MCPWM1_task_cmpr1_b_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_cmpr1_b_up_st:1;
        /** mcpwm1_task_cmpr2_b_up_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents MCPWM1_task_cmpr2_b_up trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_cmpr2_b_up_st:1;
        /** mcpwm1_task_gen_stop_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents MCPWM1_task_gen_stop trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_gen_stop_st:1;
        /** mcpwm1_task_timer0_syn_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents MCPWM1_task_timer0_syn trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_timer0_syn_st:1;
        /** mcpwm1_task_timer1_syn_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents MCPWM1_task_timer1_syn trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_timer1_syn_st:1;
        /** mcpwm1_task_timer2_syn_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents MCPWM1_task_timer2_syn trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_timer2_syn_st:1;
        /** mcpwm1_task_timer0_period_up_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents MCPWM1_task_timer0_period_up trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t mcpwm1_task_timer0_period_up_st:1;
        /** mcpwm1_task_timer1_period_up_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents MCPWM1_task_timer1_period_up trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t mcpwm1_task_timer1_period_up_st:1;
        /** mcpwm1_task_timer2_period_up_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents MCPWM1_task_timer2_period_up trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t mcpwm1_task_timer2_period_up_st:1;
        /** mcpwm1_task_tz0_ost_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents MCPWM1_task_tz0_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_tz0_ost_st:1;
        /** mcpwm1_task_tz1_ost_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents MCPWM1_task_tz1_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_tz1_ost_st:1;
        /** mcpwm1_task_tz2_ost_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents MCPWM1_task_tz2_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_tz2_ost_st:1;
        /** mcpwm1_task_clr0_ost_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents MCPWM1_task_clr0_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_clr0_ost_st:1;
        /** mcpwm1_task_clr1_ost_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents MCPWM1_task_clr1_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_clr1_ost_st:1;
        /** mcpwm1_task_clr2_ost_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents MCPWM1_task_clr2_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_clr2_ost_st:1;
        /** mcpwm1_task_cap0_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents MCPWM1_task_cap0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_cap0_st:1;
        /** mcpwm1_task_cap1_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents MCPWM1_task_cap1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_cap1_st:1;
        /** mcpwm1_task_cap2_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents MCPWM1_task_cap2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm1_task_cap2_st:1;
        /** adc_task_sample0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents ADC_task_sample0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_task_sample0_st:1;
        /** adc_task_sample1_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents ADC_task_sample1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_task_sample1_st:1;
        /** adc_task_start0_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents ADC_task_start0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_task_start0_st:1;
        /** adc_task_stop0_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents ADC_task_stop0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_task_stop0_st:1;
    };
    uint32_t val;
} soc_etm_task_st4_reg_t;

/** Type of task_st5 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** regdma_task_start0_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents REGDMA_task_start0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_task_start0_st:1;
        /** regdma_task_start1_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents REGDMA_task_start1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_task_start1_st:1;
        /** regdma_task_start2_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents REGDMA_task_start2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_task_start2_st:1;
        /** regdma_task_start3_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents REGDMA_task_start3 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_task_start3_st:1;
        /** tmpsnsr_task_start_sample_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents TMPSNSR_task_start_sample trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tmpsnsr_task_start_sample_st:1;
        /** tmpsnsr_task_stop_sample_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents TMPSNSR_task_stop_sample trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tmpsnsr_task_stop_sample_st:1;
        /** i2s0_task_start_rx_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents I2S0_task_start_rx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s0_task_start_rx_st:1;
        /** i2s0_task_start_tx_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents I2S0_task_start_tx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s0_task_start_tx_st:1;
        /** i2s0_task_stop_rx_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents I2S0_task_stop_rx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s0_task_stop_rx_st:1;
        /** i2s0_task_stop_tx_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents I2S0_task_stop_tx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s0_task_stop_tx_st:1;
        /** i2s1_task_start_rx_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents I2S1_task_start_rx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s1_task_start_rx_st:1;
        /** i2s1_task_start_tx_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents I2S1_task_start_tx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s1_task_start_tx_st:1;
        /** i2s1_task_stop_rx_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents I2S1_task_stop_rx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s1_task_stop_rx_st:1;
        /** i2s1_task_stop_tx_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents I2S1_task_stop_tx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s1_task_stop_tx_st:1;
        /** i2s2_task_start_rx_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents I2S2_task_start_rx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s2_task_start_rx_st:1;
        /** i2s2_task_start_tx_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents I2S2_task_start_tx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s2_task_start_tx_st:1;
        /** i2s2_task_stop_rx_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents I2S2_task_stop_rx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s2_task_stop_rx_st:1;
        /** i2s2_task_stop_tx_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents I2S2_task_stop_tx trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s2_task_stop_tx_st:1;
        /** ulp_task_wakeup_cpu_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents ULP_task_wakeup_cpu trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ulp_task_wakeup_cpu_st:1;
        /** ulp_task_int_cpu_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents ULP_task_int_cpu trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ulp_task_int_cpu_st:1;
        /** rtc_task_start_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents RTC_task_start trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t rtc_task_start_st:1;
        /** rtc_task_stop_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents RTC_task_stop trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t rtc_task_stop_st:1;
        /** rtc_task_clr_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents RTC_task_clr trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t rtc_task_clr_st:1;
        /** rtc_task_triggerflw_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents RTC_task_triggerflw trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t rtc_task_triggerflw_st:1;
        /** pdma_ahb_task_in_start_ch0_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents PDMA_AHB_task_in_start_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_ahb_task_in_start_ch0_st:1;
        /** pdma_ahb_task_in_start_ch1_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents PDMA_AHB_task_in_start_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_ahb_task_in_start_ch1_st:1;
        /** pdma_ahb_task_in_start_ch2_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents PDMA_AHB_task_in_start_ch2 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_ahb_task_in_start_ch2_st:1;
        /** pdma_ahb_task_out_start_ch0_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents PDMA_AHB_task_out_start_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_ahb_task_out_start_ch0_st:1;
        /** pdma_ahb_task_out_start_ch1_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents PDMA_AHB_task_out_start_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_ahb_task_out_start_ch1_st:1;
        /** pdma_ahb_task_out_start_ch2_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents PDMA_AHB_task_out_start_ch2 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_ahb_task_out_start_ch2_st:1;
        /** pdma_axi_task_in_start_ch0_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents PDMA_AXI_task_in_start_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_axi_task_in_start_ch0_st:1;
        /** pdma_axi_task_in_start_ch1_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents PDMA_AXI_task_in_start_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_axi_task_in_start_ch1_st:1;
    };
    uint32_t val;
} soc_etm_task_st5_reg_t;

