espressif/esp-idf/components/soc/esp32p4/include/soc/soc_etm_struct.h
/** Type of task_st6 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** pdma_axi_task_in_start_ch2_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents PDMA_AXI_task_in_start_ch2 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_axi_task_in_start_ch2_st:1;
        /** pdma_axi_task_out_start_ch0_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents PDMA_AXI_task_out_start_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_axi_task_out_start_ch0_st:1;
        /** pdma_axi_task_out_start_ch1_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents PDMA_AXI_task_out_start_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_axi_task_out_start_ch1_st:1;
        /** pdma_axi_task_out_start_ch2_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents PDMA_AXI_task_out_start_ch2 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t pdma_axi_task_out_start_ch2_st:1;
        /** pmu_task_sleep_req_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents PMU_task_sleep_req trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t pmu_task_sleep_req_st:1;
        /** dma2d_task_in_start_ch0_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents DMA2D_task_in_start_ch0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t dma2d_task_in_start_ch0_st:1;
        /** dma2d_task_in_start_ch1_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents DMA2D_task_in_start_ch1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t dma2d_task_in_start_ch1_st:1;
        /** dma2d_task_in_dscr_ready_ch0_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents DMA2D_task_in_dscr_ready_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t dma2d_task_in_dscr_ready_ch0_st:1;
        /** dma2d_task_in_dscr_ready_ch1_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents DMA2D_task_in_dscr_ready_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t dma2d_task_in_dscr_ready_ch1_st:1;
        /** dma2d_task_out_start_ch0_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents DMA2D_task_out_start_ch0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t dma2d_task_out_start_ch0_st:1;
        /** dma2d_task_out_start_ch1_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents DMA2D_task_out_start_ch1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t dma2d_task_out_start_ch1_st:1;
        /** dma2d_task_out_start_ch2_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents DMA2D_task_out_start_ch2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t dma2d_task_out_start_ch2_st:1;
        /** dma2d_task_out_dscr_ready_ch0_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents DMA2D_task_out_dscr_ready_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t dma2d_task_out_dscr_ready_ch0_st:1;
        /** dma2d_task_out_dscr_ready_ch1_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents DMA2D_task_out_dscr_ready_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t dma2d_task_out_dscr_ready_ch1_st:1;
        /** dma2d_task_out_dscr_ready_ch2_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents DMA2D_task_out_dscr_ready_ch2 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t dma2d_task_out_dscr_ready_ch2_st:1;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} soc_etm_task_st6_reg_t;


/** Group: Configuration Register */
/** Type of ch_ena_ad0_set register
 *  Channel enable set register
 */
typedef union {
    struct {
        /** ch_set0 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to enable ch0.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set0:1;
        /** ch_set1 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to enable ch1.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set1:1;
        /** ch_set2 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to enable ch2.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set2:1;
        /** ch_set3 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to enable ch3.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set3:1;
        /** ch_set4 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to enable ch4.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set4:1;
        /** ch_set5 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to enable ch5.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set5:1;
        /** ch_set6 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to enable ch6.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set6:1;
        /** ch_set7 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to enable ch7.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set7:1;
        /** ch_set8 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to enable ch8.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set8:1;
        /** ch_set9 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to enable ch9.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set9:1;
        /** ch_set10 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to enable ch10.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set10:1;
        /** ch_set11 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to enable ch11.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set11:1;
        /** ch_set12 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to enable ch12.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set12:1;
        /** ch_set13 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to enable ch13.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set13:1;
        /** ch_set14 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to enable ch14.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set14:1;
        /** ch_set15 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to enable ch15.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set15:1;
        /** ch_set16 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to enable ch16.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set16:1;
        /** ch_set17 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to enable ch17.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set17:1;
        /** ch_set18 : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to enable ch18.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set18:1;
        /** ch_set19 : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to enable ch19.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set19:1;
        /** ch_set20 : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to enable ch20.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set20:1;
        /** ch_set21 : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to enable ch21.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set21:1;
        /** ch_set22 : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to enable ch22.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set22:1;
        /** ch_set23 : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to enable ch23.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set23:1;
        /** ch_set24 : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to enable ch24.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set24:1;
        /** ch_set25 : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to enable ch25.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set25:1;
        /** ch_set26 : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to enable ch26.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set26:1;
        /** ch_set27 : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to enable ch27.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set27:1;
        /** ch_set28 : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to enable ch28.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set28:1;
        /** ch_set29 : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to enable ch29.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set29:1;
        /** ch_set30 : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to enable ch30.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set30:1;
        /** ch_set31 : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to enable ch31.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_set_reg_t;

/** Type of ch_ena_ad0_clr register
 *  Channel enable clear register
 */
typedef union {
    struct {
        /** ch_clr0 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear ch0 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr0:1;
        /** ch_clr1 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear ch1 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr1:1;
        /** ch_clr2 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear ch2 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr2:1;
        /** ch_clr3 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear ch3 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr3:1;
        /** ch_clr4 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear ch4 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr4:1;
        /** ch_clr5 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear ch5 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr5:1;
        /** ch_clr6 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear ch6 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr6:1;
        /** ch_clr7 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear ch7 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr7:1;
        /** ch_clr8 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear ch8 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr8:1;
        /** ch_clr9 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear ch9 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr9:1;
        /** ch_clr10 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear ch10 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr10:1;
        /** ch_clr11 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear ch11 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr11:1;
        /** ch_clr12 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear ch12 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr12:1;
        /** ch_clr13 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear ch13 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr13:1;
        /** ch_clr14 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear ch14 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr14:1;
        /** ch_clr15 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear ch15 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr15:1;
        /** ch_clr16 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear ch16 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr16:1;
        /** ch_clr17 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear ch17 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr17:1;
        /** ch_clr18 : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear ch18 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr18:1;
        /** ch_clr19 : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear ch19 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr19:1;
        /** ch_clr20 : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear ch20 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr20:1;
        /** ch_clr21 : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear ch21 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr21:1;
        /** ch_clr22 : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear ch22 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr22:1;
        /** ch_clr23 : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear ch23 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr23:1;
        /** ch_clr24 : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear ch24 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr24:1;
        /** ch_clr25 : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear ch25 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr25:1;
        /** ch_clr26 : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear ch26 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr26:1;
        /** ch_clr27 : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear ch27 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr27:1;
        /** ch_clr28 : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear ch28 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr28:1;
        /** ch_clr29 : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear ch29 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr29:1;
        /** ch_clr30 : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear ch30 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr30:1;
        /** ch_clr31 : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear ch31 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_clr_reg_t;

/** Type of ch_ena_ad1_set register
 *  Channel enable set register
 */
typedef union {
    struct {
        /** ch_set32 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to enable ch32.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set32:1;
        /** ch_set33 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to enable ch33.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set33:1;
        /** ch_set34 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to enable ch34.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set34:1;
        /** ch_set35 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to enable ch35.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set35:1;
        /** ch_set36 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to enable ch36.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set36:1;
        /** ch_set37 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to enable ch37.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set37:1;
        /** ch_set38 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to enable ch38.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set38:1;
        /** ch_set39 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to enable ch39.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set39:1;
        /** ch_set40 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to enable ch40.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set40:1;
        /** ch_set41 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to enable ch41.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set41:1;
        /** ch_set42 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to enable ch42.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set42:1;
        /** ch_set43 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to enable ch43.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set43:1;
        /** ch_set44 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to enable ch44.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set44:1;
        /** ch_set45 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to enable ch45.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set45:1;
        /** ch_set46 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to enable ch46.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set46:1;
        /** ch_set47 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to enable ch47.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set47:1;
        /** ch_set48 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to enable ch48.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set48:1;
        /** ch_set49 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to enable ch49.\\0: Invalid, No effect\\1: Enable
         */
        uint32_t ch_set49:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_ch_ena_ad1_set_reg_t;

