espressif/esp-idf/components/soc/esp32p4/include/soc/soc_etm_struct.h
/** Type of ch_ena_ad1_clr register
 *  Channel enable clear register
 */
typedef union {
    struct {
        /** ch_clr32 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear ch32 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr32:1;
        /** ch_clr33 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear ch33 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr33:1;
        /** ch_clr34 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear ch34 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr34:1;
        /** ch_clr35 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear ch35 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr35:1;
        /** ch_clr36 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear ch36 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr36:1;
        /** ch_clr37 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear ch37 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr37:1;
        /** ch_clr38 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear ch38 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr38:1;
        /** ch_clr39 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear ch39 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr39:1;
        /** ch_clr40 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear ch40 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr40:1;
        /** ch_clr41 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear ch41 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr41:1;
        /** ch_clr42 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear ch42 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr42:1;
        /** ch_clr43 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear ch43 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr43:1;
        /** ch_clr44 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear ch44 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr44:1;
        /** ch_clr45 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear ch45 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr45:1;
        /** ch_clr46 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear ch46 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr46:1;
        /** ch_clr47 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear ch47 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr47:1;
        /** ch_clr48 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear ch48 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr48:1;
        /** ch_clr49 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear ch49 enable.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ch_clr49:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_ch_ena_ad1_clr_reg_t;

/** Type of ch0_evt_id register
 *  Channel0 event id register
 */
typedef union {
    struct {
        /** ch0_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch0_evt_id
         */
        uint32_t ch0_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch0_evt_id_reg_t;

/** Type of ch0_task_id register
 *  Channel0 task id register
 */
typedef union {
    struct {
        /** ch0_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch0_task_id
         */
        uint32_t ch0_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch0_task_id_reg_t;

/** Type of ch1_evt_id register
 *  Channel1 event id register
 */
typedef union {
    struct {
        /** ch1_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch1_evt_id
         */
        uint32_t ch1_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch1_evt_id_reg_t;

/** Type of ch1_task_id register
 *  Channel1 task id register
 */
typedef union {
    struct {
        /** ch1_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch1_task_id
         */
        uint32_t ch1_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch1_task_id_reg_t;

/** Type of ch2_evt_id register
 *  Channel2 event id register
 */
typedef union {
    struct {
        /** ch2_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch2_evt_id
         */
        uint32_t ch2_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch2_evt_id_reg_t;

/** Type of ch2_task_id register
 *  Channel2 task id register
 */
typedef union {
    struct {
        /** ch2_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch2_task_id
         */
        uint32_t ch2_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch2_task_id_reg_t;

/** Type of ch3_evt_id register
 *  Channel3 event id register
 */
typedef union {
    struct {
        /** ch3_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch3_evt_id
         */
        uint32_t ch3_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch3_evt_id_reg_t;

/** Type of ch3_task_id register
 *  Channel3 task id register
 */
typedef union {
    struct {
        /** ch3_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch3_task_id
         */
        uint32_t ch3_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch3_task_id_reg_t;

