espressif/esp-idf/components/soc/esp32p4/include/soc/soc_etm_struct.h
/** Type of ch4_evt_id register
 *  Channel4 event id register
 */
typedef union {
    struct {
        /** ch4_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch4_evt_id
         */
        uint32_t ch4_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch4_evt_id_reg_t;

/** Type of ch4_task_id register
 *  Channel4 task id register
 */
typedef union {
    struct {
        /** ch4_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch4_task_id
         */
        uint32_t ch4_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch4_task_id_reg_t;

/** Type of ch5_evt_id register
 *  Channel5 event id register
 */
typedef union {
    struct {
        /** ch5_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch5_evt_id
         */
        uint32_t ch5_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch5_evt_id_reg_t;

/** Type of ch5_task_id register
 *  Channel5 task id register
 */
typedef union {
    struct {
        /** ch5_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch5_task_id
         */
        uint32_t ch5_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch5_task_id_reg_t;

/** Type of ch6_evt_id register
 *  Channel6 event id register
 */
typedef union {
    struct {
        /** ch6_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch6_evt_id
         */
        uint32_t ch6_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch6_evt_id_reg_t;

/** Type of ch6_task_id register
 *  Channel6 task id register
 */
typedef union {
    struct {
        /** ch6_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch6_task_id
         */
        uint32_t ch6_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch6_task_id_reg_t;

/** Type of ch7_evt_id register
 *  Channel7 event id register
 */
typedef union {
    struct {
        /** ch7_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch7_evt_id
         */
        uint32_t ch7_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch7_evt_id_reg_t;

/** Type of ch7_task_id register
 *  Channel7 task id register
 */
typedef union {
    struct {
        /** ch7_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch7_task_id
         */
        uint32_t ch7_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch7_task_id_reg_t;

/** Type of ch8_evt_id register
 *  Channel8 event id register
 */
typedef union {
    struct {
        /** ch8_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch8_evt_id
         */
        uint32_t ch8_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch8_evt_id_reg_t;

/** Type of ch8_task_id register
 *  Channel8 task id register
 */
typedef union {
    struct {
        /** ch8_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch8_task_id
         */
        uint32_t ch8_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch8_task_id_reg_t;

/** Type of ch9_evt_id register
 *  Channel9 event id register
 */
typedef union {
    struct {
        /** ch9_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch9_evt_id
         */
        uint32_t ch9_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch9_evt_id_reg_t;

/** Type of ch9_task_id register
 *  Channel9 task id register
 */
typedef union {
    struct {
        /** ch9_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch9_task_id
         */
        uint32_t ch9_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch9_task_id_reg_t;

/** Type of ch10_evt_id register
 *  Channel10 event id register
 */
typedef union {
    struct {
        /** ch10_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch10_evt_id
         */
        uint32_t ch10_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch10_evt_id_reg_t;

/** Type of ch10_task_id register
 *  Channel10 task id register
 */
typedef union {
    struct {
        /** ch10_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch10_task_id
         */
        uint32_t ch10_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch10_task_id_reg_t;

/** Type of ch11_evt_id register
 *  Channel11 event id register
 */
typedef union {
    struct {
        /** ch11_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch11_evt_id
         */
        uint32_t ch11_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch11_evt_id_reg_t;

/** Type of ch11_task_id register
 *  Channel11 task id register
 */
typedef union {
    struct {
        /** ch11_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch11_task_id
         */
        uint32_t ch11_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch11_task_id_reg_t;

/** Type of ch12_evt_id register
 *  Channel12 event id register
 */
typedef union {
    struct {
        /** ch12_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch12_evt_id
         */
        uint32_t ch12_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch12_evt_id_reg_t;

/** Type of ch12_task_id register
 *  Channel12 task id register
 */
typedef union {
    struct {
        /** ch12_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch12_task_id
         */
        uint32_t ch12_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch12_task_id_reg_t;

/** Type of ch13_evt_id register
 *  Channel13 event id register
 */
typedef union {
    struct {
        /** ch13_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch13_evt_id
         */
        uint32_t ch13_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch13_evt_id_reg_t;

/** Type of ch13_task_id register
 *  Channel13 task id register
 */
typedef union {
    struct {
        /** ch13_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch13_task_id
         */
        uint32_t ch13_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch13_task_id_reg_t;

/** Type of ch14_evt_id register
 *  Channel14 event id register
 */
typedef union {
    struct {
        /** ch14_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch14_evt_id
         */
        uint32_t ch14_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch14_evt_id_reg_t;

/** Type of ch14_task_id register
 *  Channel14 task id register
 */
typedef union {
    struct {
        /** ch14_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch14_task_id
         */
        uint32_t ch14_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch14_task_id_reg_t;

/** Type of ch15_evt_id register
 *  Channel15 event id register
 */
typedef union {
    struct {
        /** ch15_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch15_evt_id
         */
        uint32_t ch15_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch15_evt_id_reg_t;

/** Type of ch15_task_id register
 *  Channel15 task id register
 */
typedef union {
    struct {
        /** ch15_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch15_task_id
         */
        uint32_t ch15_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch15_task_id_reg_t;

/** Type of ch16_evt_id register
 *  Channel16 event id register
 */
typedef union {
    struct {
        /** ch16_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch16_evt_id
         */
        uint32_t ch16_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch16_evt_id_reg_t;

