espressif/esp-idf/components/soc/esp32p4/include/soc/soc_etm_struct.h
/** Type of ch16_task_id register
 *  Channel16 task id register
 */
typedef union {
    struct {
        /** ch16_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch16_task_id
         */
        uint32_t ch16_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch16_task_id_reg_t;

/** Type of ch17_evt_id register
 *  Channel17 event id register
 */
typedef union {
    struct {
        /** ch17_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch17_evt_id
         */
        uint32_t ch17_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch17_evt_id_reg_t;

/** Type of ch17_task_id register
 *  Channel17 task id register
 */
typedef union {
    struct {
        /** ch17_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch17_task_id
         */
        uint32_t ch17_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch17_task_id_reg_t;

/** Type of ch18_evt_id register
 *  Channel18 event id register
 */
typedef union {
    struct {
        /** ch18_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch18_evt_id
         */
        uint32_t ch18_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch18_evt_id_reg_t;

/** Type of ch18_task_id register
 *  Channel18 task id register
 */
typedef union {
    struct {
        /** ch18_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch18_task_id
         */
        uint32_t ch18_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch18_task_id_reg_t;

/** Type of ch19_evt_id register
 *  Channel19 event id register
 */
typedef union {
    struct {
        /** ch19_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch19_evt_id
         */
        uint32_t ch19_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch19_evt_id_reg_t;

/** Type of ch19_task_id register
 *  Channel19 task id register
 */
typedef union {
    struct {
        /** ch19_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch19_task_id
         */
        uint32_t ch19_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch19_task_id_reg_t;

/** Type of ch20_evt_id register
 *  Channel20 event id register
 */
typedef union {
    struct {
        /** ch20_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch20_evt_id
         */
        uint32_t ch20_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch20_evt_id_reg_t;

/** Type of ch20_task_id register
 *  Channel20 task id register
 */
typedef union {
    struct {
        /** ch20_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch20_task_id
         */
        uint32_t ch20_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch20_task_id_reg_t;

/** Type of ch21_evt_id register
 *  Channel21 event id register
 */
typedef union {
    struct {
        /** ch21_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch21_evt_id
         */
        uint32_t ch21_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch21_evt_id_reg_t;

/** Type of ch21_task_id register
 *  Channel21 task id register
 */
typedef union {
    struct {
        /** ch21_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch21_task_id
         */
        uint32_t ch21_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch21_task_id_reg_t;

/** Type of ch22_evt_id register
 *  Channel22 event id register
 */
typedef union {
    struct {
        /** ch22_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch22_evt_id
         */
        uint32_t ch22_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch22_evt_id_reg_t;

/** Type of ch22_task_id register
 *  Channel22 task id register
 */
typedef union {
    struct {
        /** ch22_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch22_task_id
         */
        uint32_t ch22_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch22_task_id_reg_t;

/** Type of ch23_evt_id register
 *  Channel23 event id register
 */
typedef union {
    struct {
        /** ch23_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch23_evt_id
         */
        uint32_t ch23_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch23_evt_id_reg_t;

/** Type of ch23_task_id register
 *  Channel23 task id register
 */
typedef union {
    struct {
        /** ch23_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch23_task_id
         */
        uint32_t ch23_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch23_task_id_reg_t;

/** Type of ch24_evt_id register
 *  Channel24 event id register
 */
typedef union {
    struct {
        /** ch24_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch24_evt_id
         */
        uint32_t ch24_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch24_evt_id_reg_t;

/** Type of ch24_task_id register
 *  Channel24 task id register
 */
typedef union {
    struct {
        /** ch24_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch24_task_id
         */
        uint32_t ch24_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch24_task_id_reg_t;

/** Type of ch25_evt_id register
 *  Channel25 event id register
 */
typedef union {
    struct {
        /** ch25_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch25_evt_id
         */
        uint32_t ch25_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch25_evt_id_reg_t;

/** Type of ch25_task_id register
 *  Channel25 task id register
 */
typedef union {
    struct {
        /** ch25_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch25_task_id
         */
        uint32_t ch25_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch25_task_id_reg_t;

/** Type of ch26_evt_id register
 *  Channel26 event id register
 */
typedef union {
    struct {
        /** ch26_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch26_evt_id
         */
        uint32_t ch26_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch26_evt_id_reg_t;

/** Type of ch26_task_id register
 *  Channel26 task id register
 */
typedef union {
    struct {
        /** ch26_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch26_task_id
         */
        uint32_t ch26_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch26_task_id_reg_t;

