espressif/esp-idf/components/soc/esp32p4/include/soc/soc_etm_struct.h
/** Type of ch27_evt_id register
 *  Channel27 event id register
 */
typedef union {
    struct {
        /** ch27_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch27_evt_id
         */
        uint32_t ch27_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch27_evt_id_reg_t;

/** Type of ch27_task_id register
 *  Channel27 task id register
 */
typedef union {
    struct {
        /** ch27_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch27_task_id
         */
        uint32_t ch27_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch27_task_id_reg_t;

/** Type of ch28_evt_id register
 *  Channel28 event id register
 */
typedef union {
    struct {
        /** ch28_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch28_evt_id
         */
        uint32_t ch28_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch28_evt_id_reg_t;

/** Type of ch28_task_id register
 *  Channel28 task id register
 */
typedef union {
    struct {
        /** ch28_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch28_task_id
         */
        uint32_t ch28_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch28_task_id_reg_t;

/** Type of ch29_evt_id register
 *  Channel29 event id register
 */
typedef union {
    struct {
        /** ch29_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch29_evt_id
         */
        uint32_t ch29_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch29_evt_id_reg_t;

/** Type of ch29_task_id register
 *  Channel29 task id register
 */
typedef union {
    struct {
        /** ch29_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch29_task_id
         */
        uint32_t ch29_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch29_task_id_reg_t;

/** Type of ch30_evt_id register
 *  Channel30 event id register
 */
typedef union {
    struct {
        /** ch30_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch30_evt_id
         */
        uint32_t ch30_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch30_evt_id_reg_t;

/** Type of ch30_task_id register
 *  Channel30 task id register
 */
typedef union {
    struct {
        /** ch30_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch30_task_id
         */
        uint32_t ch30_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch30_task_id_reg_t;

/** Type of ch31_evt_id register
 *  Channel31 event id register
 */
typedef union {
    struct {
        /** ch31_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch31_evt_id
         */
        uint32_t ch31_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch31_evt_id_reg_t;

/** Type of ch31_task_id register
 *  Channel31 task id register
 */
typedef union {
    struct {
        /** ch31_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch31_task_id
         */
        uint32_t ch31_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch31_task_id_reg_t;

/** Type of ch32_evt_id register
 *  Channel32 event id register
 */
typedef union {
    struct {
        /** ch32_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch32_evt_id
         */
        uint32_t ch32_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch32_evt_id_reg_t;

/** Type of ch32_task_id register
 *  Channel32 task id register
 */
typedef union {
    struct {
        /** ch32_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch32_task_id
         */
        uint32_t ch32_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch32_task_id_reg_t;

/** Type of ch33_evt_id register
 *  Channel33 event id register
 */
typedef union {
    struct {
        /** ch33_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch33_evt_id
         */
        uint32_t ch33_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch33_evt_id_reg_t;

/** Type of ch33_task_id register
 *  Channel33 task id register
 */
typedef union {
    struct {
        /** ch33_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch33_task_id
         */
        uint32_t ch33_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch33_task_id_reg_t;

/** Type of ch34_evt_id register
 *  Channel34 event id register
 */
typedef union {
    struct {
        /** ch34_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch34_evt_id
         */
        uint32_t ch34_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch34_evt_id_reg_t;

/** Type of ch34_task_id register
 *  Channel34 task id register
 */
typedef union {
    struct {
        /** ch34_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch34_task_id
         */
        uint32_t ch34_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch34_task_id_reg_t;

/** Type of ch35_evt_id register
 *  Channel35 event id register
 */
typedef union {
    struct {
        /** ch35_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch35_evt_id
         */
        uint32_t ch35_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch35_evt_id_reg_t;

/** Type of ch35_task_id register
 *  Channel35 task id register
 */
typedef union {
    struct {
        /** ch35_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch35_task_id
         */
        uint32_t ch35_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch35_task_id_reg_t;

/** Type of ch36_evt_id register
 *  Channel36 event id register
 */
typedef union {
    struct {
        /** ch36_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch36_evt_id
         */
        uint32_t ch36_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch36_evt_id_reg_t;

/** Type of ch36_task_id register
 *  Channel36 task id register
 */
typedef union {
    struct {
        /** ch36_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch36_task_id
         */
        uint32_t ch36_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch36_task_id_reg_t;

/** Type of ch37_evt_id register
 *  Channel37 event id register
 */
typedef union {
    struct {
        /** ch37_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch37_evt_id
         */
        uint32_t ch37_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch37_evt_id_reg_t;

