espressif/esp-idf/components/soc/esp32p4/include/soc/soc_etm_struct.h
/** Type of ch37_task_id register
 *  Channel37 task id register
 */
typedef union {
    struct {
        /** ch37_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch37_task_id
         */
        uint32_t ch37_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch37_task_id_reg_t;

/** Type of ch38_evt_id register
 *  Channel38 event id register
 */
typedef union {
    struct {
        /** ch38_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch38_evt_id
         */
        uint32_t ch38_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch38_evt_id_reg_t;

/** Type of ch38_task_id register
 *  Channel38 task id register
 */
typedef union {
    struct {
        /** ch38_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch38_task_id
         */
        uint32_t ch38_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch38_task_id_reg_t;

/** Type of ch39_evt_id register
 *  Channel39 event id register
 */
typedef union {
    struct {
        /** ch39_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch39_evt_id
         */
        uint32_t ch39_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch39_evt_id_reg_t;

/** Type of ch39_task_id register
 *  Channel39 task id register
 */
typedef union {
    struct {
        /** ch39_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch39_task_id
         */
        uint32_t ch39_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch39_task_id_reg_t;

/** Type of ch40_evt_id register
 *  Channel40 event id register
 */
typedef union {
    struct {
        /** ch40_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch40_evt_id
         */
        uint32_t ch40_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch40_evt_id_reg_t;

/** Type of ch40_task_id register
 *  Channel40 task id register
 */
typedef union {
    struct {
        /** ch40_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch40_task_id
         */
        uint32_t ch40_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch40_task_id_reg_t;

/** Type of ch41_evt_id register
 *  Channel41 event id register
 */
typedef union {
    struct {
        /** ch41_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch41_evt_id
         */
        uint32_t ch41_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch41_evt_id_reg_t;

/** Type of ch41_task_id register
 *  Channel41 task id register
 */
typedef union {
    struct {
        /** ch41_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch41_task_id
         */
        uint32_t ch41_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch41_task_id_reg_t;

/** Type of ch42_evt_id register
 *  Channel42 event id register
 */
typedef union {
    struct {
        /** ch42_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch42_evt_id
         */
        uint32_t ch42_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch42_evt_id_reg_t;

/** Type of ch42_task_id register
 *  Channel42 task id register
 */
typedef union {
    struct {
        /** ch42_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch42_task_id
         */
        uint32_t ch42_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch42_task_id_reg_t;

/** Type of ch43_evt_id register
 *  Channel43 event id register
 */
typedef union {
    struct {
        /** ch43_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch43_evt_id
         */
        uint32_t ch43_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch43_evt_id_reg_t;

/** Type of ch43_task_id register
 *  Channel43 task id register
 */
typedef union {
    struct {
        /** ch43_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch43_task_id
         */
        uint32_t ch43_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch43_task_id_reg_t;

/** Type of ch44_evt_id register
 *  Channel44 event id register
 */
typedef union {
    struct {
        /** ch44_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch44_evt_id
         */
        uint32_t ch44_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch44_evt_id_reg_t;

/** Type of ch44_task_id register
 *  Channel44 task id register
 */
typedef union {
    struct {
        /** ch44_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch44_task_id
         */
        uint32_t ch44_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch44_task_id_reg_t;

/** Type of ch45_evt_id register
 *  Channel45 event id register
 */
typedef union {
    struct {
        /** ch45_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch45_evt_id
         */
        uint32_t ch45_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch45_evt_id_reg_t;

/** Type of ch45_task_id register
 *  Channel45 task id register
 */
typedef union {
    struct {
        /** ch45_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch45_task_id
         */
        uint32_t ch45_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch45_task_id_reg_t;

/** Type of ch46_evt_id register
 *  Channel46 event id register
 */
typedef union {
    struct {
        /** ch46_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch46_evt_id
         */
        uint32_t ch46_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch46_evt_id_reg_t;

/** Type of ch46_task_id register
 *  Channel46 task id register
 */
typedef union {
    struct {
        /** ch46_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch46_task_id
         */
        uint32_t ch46_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch46_task_id_reg_t;

/** Type of ch47_evt_id register
 *  Channel47 event id register
 */
typedef union {
    struct {
        /** ch47_evt_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch47_evt_id
         */
        uint32_t ch47_evt_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch47_evt_id_reg_t;

/** Type of ch47_task_id register
 *  Channel47 task id register
 */
typedef union {
    struct {
        /** ch47_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures ch47_task_id
         */
        uint32_t ch47_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_ch47_task_id_reg_t;

