espressif/esp-idf/components/soc/esp32p4/include/soc/soc_etm_struct.h
/** Type of clk_en register
 *  ETM clock enable register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to open register clock gate.\\0: Open the clock gate only
         *  when application writes registers\\1: Force open the clock gate for register
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} soc_etm_clk_en_reg_t;


/** Group: Version Register */
/** Type of date register
 *  ETM date register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 36712497;
         *  Configures the version.
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} soc_etm_date_reg_t;


typedef struct {
    volatile soc_etm_ch_ena_ad0_reg_t ch_ena_ad0;
    volatile soc_etm_ch_ena_ad0_set_reg_t ch_ena_ad0_set;
    volatile soc_etm_ch_ena_ad0_clr_reg_t ch_ena_ad0_clr;
    volatile soc_etm_ch_ena_ad1_reg_t ch_ena_ad1;
    volatile soc_etm_ch_ena_ad1_set_reg_t ch_ena_ad1_set;
    volatile soc_etm_ch_ena_ad1_clr_reg_t ch_ena_ad1_clr;
    volatile soc_etm_ch0_evt_id_reg_t ch0_evt_id;
    volatile soc_etm_ch0_task_id_reg_t ch0_task_id;
    volatile soc_etm_ch1_evt_id_reg_t ch1_evt_id;
    volatile soc_etm_ch1_task_id_reg_t ch1_task_id;
    volatile soc_etm_ch2_evt_id_reg_t ch2_evt_id;
    volatile soc_etm_ch2_task_id_reg_t ch2_task_id;
    volatile soc_etm_ch3_evt_id_reg_t ch3_evt_id;
    volatile soc_etm_ch3_task_id_reg_t ch3_task_id;
    volatile soc_etm_ch4_evt_id_reg_t ch4_evt_id;
    volatile soc_etm_ch4_task_id_reg_t ch4_task_id;
    volatile soc_etm_ch5_evt_id_reg_t ch5_evt_id;
    volatile soc_etm_ch5_task_id_reg_t ch5_task_id;
    volatile soc_etm_ch6_evt_id_reg_t ch6_evt_id;
    volatile soc_etm_ch6_task_id_reg_t ch6_task_id;
    volatile soc_etm_ch7_evt_id_reg_t ch7_evt_id;
    volatile soc_etm_ch7_task_id_reg_t ch7_task_id;
    volatile soc_etm_ch8_evt_id_reg_t ch8_evt_id;
    volatile soc_etm_ch8_task_id_reg_t ch8_task_id;
    volatile soc_etm_ch9_evt_id_reg_t ch9_evt_id;
    volatile soc_etm_ch9_task_id_reg_t ch9_task_id;
    volatile soc_etm_ch10_evt_id_reg_t ch10_evt_id;
    volatile soc_etm_ch10_task_id_reg_t ch10_task_id;
    volatile soc_etm_ch11_evt_id_reg_t ch11_evt_id;
    volatile soc_etm_ch11_task_id_reg_t ch11_task_id;
    volatile soc_etm_ch12_evt_id_reg_t ch12_evt_id;
    volatile soc_etm_ch12_task_id_reg_t ch12_task_id;
    volatile soc_etm_ch13_evt_id_reg_t ch13_evt_id;
    volatile soc_etm_ch13_task_id_reg_t ch13_task_id;
    volatile soc_etm_ch14_evt_id_reg_t ch14_evt_id;
    volatile soc_etm_ch14_task_id_reg_t ch14_task_id;
    volatile soc_etm_ch15_evt_id_reg_t ch15_evt_id;
    volatile soc_etm_ch15_task_id_reg_t ch15_task_id;
    volatile soc_etm_ch16_evt_id_reg_t ch16_evt_id;
    volatile soc_etm_ch16_task_id_reg_t ch16_task_id;
    volatile soc_etm_ch17_evt_id_reg_t ch17_evt_id;
    volatile soc_etm_ch17_task_id_reg_t ch17_task_id;
    volatile soc_etm_ch18_evt_id_reg_t ch18_evt_id;
    volatile soc_etm_ch18_task_id_reg_t ch18_task_id;
    volatile soc_etm_ch19_evt_id_reg_t ch19_evt_id;
    volatile soc_etm_ch19_task_id_reg_t ch19_task_id;
    volatile soc_etm_ch20_evt_id_reg_t ch20_evt_id;
    volatile soc_etm_ch20_task_id_reg_t ch20_task_id;
    volatile soc_etm_ch21_evt_id_reg_t ch21_evt_id;
    volatile soc_etm_ch21_task_id_reg_t ch21_task_id;
    volatile soc_etm_ch22_evt_id_reg_t ch22_evt_id;
    volatile soc_etm_ch22_task_id_reg_t ch22_task_id;
    volatile soc_etm_ch23_evt_id_reg_t ch23_evt_id;
    volatile soc_etm_ch23_task_id_reg_t ch23_task_id;
    volatile soc_etm_ch24_evt_id_reg_t ch24_evt_id;
    volatile soc_etm_ch24_task_id_reg_t ch24_task_id;
    volatile soc_etm_ch25_evt_id_reg_t ch25_evt_id;
    volatile soc_etm_ch25_task_id_reg_t ch25_task_id;
    volatile soc_etm_ch26_evt_id_reg_t ch26_evt_id;
    volatile soc_etm_ch26_task_id_reg_t ch26_task_id;
    volatile soc_etm_ch27_evt_id_reg_t ch27_evt_id;
    volatile soc_etm_ch27_task_id_reg_t ch27_task_id;
    volatile soc_etm_ch28_evt_id_reg_t ch28_evt_id;
    volatile soc_etm_ch28_task_id_reg_t ch28_task_id;
    volatile soc_etm_ch29_evt_id_reg_t ch29_evt_id;
    volatile soc_etm_ch29_task_id_reg_t ch29_task_id;
    volatile soc_etm_ch30_evt_id_reg_t ch30_evt_id;
    volatile soc_etm_ch30_task_id_reg_t ch30_task_id;
    volatile soc_etm_ch31_evt_id_reg_t ch31_evt_id;
    volatile soc_etm_ch31_task_id_reg_t ch31_task_id;
    volatile soc_etm_ch32_evt_id_reg_t ch32_evt_id;
    volatile soc_etm_ch32_task_id_reg_t ch32_task_id;
    volatile soc_etm_ch33_evt_id_reg_t ch33_evt_id;
    volatile soc_etm_ch33_task_id_reg_t ch33_task_id;
    volatile soc_etm_ch34_evt_id_reg_t ch34_evt_id;
    volatile soc_etm_ch34_task_id_reg_t ch34_task_id;
    volatile soc_etm_ch35_evt_id_reg_t ch35_evt_id;
    volatile soc_etm_ch35_task_id_reg_t ch35_task_id;
    volatile soc_etm_ch36_evt_id_reg_t ch36_evt_id;
    volatile soc_etm_ch36_task_id_reg_t ch36_task_id;
    volatile soc_etm_ch37_evt_id_reg_t ch37_evt_id;
    volatile soc_etm_ch37_task_id_reg_t ch37_task_id;
    volatile soc_etm_ch38_evt_id_reg_t ch38_evt_id;
    volatile soc_etm_ch38_task_id_reg_t ch38_task_id;
    volatile soc_etm_ch39_evt_id_reg_t ch39_evt_id;
    volatile soc_etm_ch39_task_id_reg_t ch39_task_id;
    volatile soc_etm_ch40_evt_id_reg_t ch40_evt_id;
    volatile soc_etm_ch40_task_id_reg_t ch40_task_id;
    volatile soc_etm_ch41_evt_id_reg_t ch41_evt_id;
    volatile soc_etm_ch41_task_id_reg_t ch41_task_id;
    volatile soc_etm_ch42_evt_id_reg_t ch42_evt_id;
    volatile soc_etm_ch42_task_id_reg_t ch42_task_id;
    volatile soc_etm_ch43_evt_id_reg_t ch43_evt_id;
    volatile soc_etm_ch43_task_id_reg_t ch43_task_id;
    volatile soc_etm_ch44_evt_id_reg_t ch44_evt_id;
    volatile soc_etm_ch44_task_id_reg_t ch44_task_id;
    volatile soc_etm_ch45_evt_id_reg_t ch45_evt_id;
    volatile soc_etm_ch45_task_id_reg_t ch45_task_id;
    volatile soc_etm_ch46_evt_id_reg_t ch46_evt_id;
    volatile soc_etm_ch46_task_id_reg_t ch46_task_id;
    volatile soc_etm_ch47_evt_id_reg_t ch47_evt_id;
    volatile soc_etm_ch47_task_id_reg_t ch47_task_id;
    volatile soc_etm_ch48_evt_id_reg_t ch48_evt_id;
    volatile soc_etm_ch48_task_id_reg_t ch48_task_id;
    volatile soc_etm_ch49_evt_id_reg_t ch49_evt_id;
    volatile soc_etm_ch49_task_id_reg_t ch49_task_id;
    volatile soc_etm_evt_st0_reg_t evt_st0;
    volatile soc_etm_evt_st0_clr_reg_t evt_st0_clr;
    volatile soc_etm_evt_st1_reg_t evt_st1;
    volatile soc_etm_evt_st1_clr_reg_t evt_st1_clr;
    volatile soc_etm_evt_st2_reg_t evt_st2;
    volatile soc_etm_evt_st2_clr_reg_t evt_st2_clr;
    volatile soc_etm_evt_st3_reg_t evt_st3;
    volatile soc_etm_evt_st3_clr_reg_t evt_st3_clr;
    volatile soc_etm_evt_st4_reg_t evt_st4;
    volatile soc_etm_evt_st4_clr_reg_t evt_st4_clr;
    volatile soc_etm_evt_st5_reg_t evt_st5;
    volatile soc_etm_evt_st5_clr_reg_t evt_st5_clr;
    volatile soc_etm_evt_st6_reg_t evt_st6;
    volatile soc_etm_evt_st6_clr_reg_t evt_st6_clr;
    volatile soc_etm_evt_st7_reg_t evt_st7;
    volatile soc_etm_evt_st7_clr_reg_t evt_st7_clr;
    volatile soc_etm_task_st0_reg_t task_st0;
    volatile soc_etm_task_st0_clr_reg_t task_st0_clr;
    volatile soc_etm_task_st1_reg_t task_st1;
    volatile soc_etm_task_st1_clr_reg_t task_st1_clr;
    volatile soc_etm_task_st2_reg_t task_st2;
    volatile soc_etm_task_st2_clr_reg_t task_st2_clr;
    volatile soc_etm_task_st3_reg_t task_st3;
    volatile soc_etm_task_st3_clr_reg_t task_st3_clr;
    volatile soc_etm_task_st4_reg_t task_st4;
    volatile soc_etm_task_st4_clr_reg_t task_st4_clr;
    volatile soc_etm_task_st5_reg_t task_st5;
    volatile soc_etm_task_st5_clr_reg_t task_st5_clr;
    volatile soc_etm_task_st6_reg_t task_st6;
    volatile soc_etm_task_st6_clr_reg_t task_st6_clr;
    volatile soc_etm_clk_en_reg_t clk_en;
    volatile soc_etm_date_reg_t date;
} soc_etm_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(soc_etm_dev_t) == 0x228, "Invalid size of soc_etm_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
